Autodesk.Revit.UI.RibbonItemData.ToolTip
The description that appears as a ToolTip for the item.
Remarks: The text that is displayed when the mouse pointer moves over the item.
SplitButton and RadioButtonGroup cannot display the tooltip set by this method, the SplitButton will
always show the current PushButton tooltip, and RadioButtonGroup has no tooltip.

Autodesk.Revit.UI.RibbonItemData.Name
The name of the item.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when setting the value to null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when setting the value to an empty string.